#include "jdq.h"
/**************************************************************************
	函数名          ：sensor_init;
	功能            ：LED灯控制引脚的初始化；
***************************************************************************/
void jdq_init(void)																			//GPIO的初始化配置
{
		GPIO_InitTypeDef GPIO_InitStructure;			//定义一个GPIO_InitTypeDef类型的结构体
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);		//开启GPIOA的外设时钟

		GPIO_InitStructure.GPIO_Pin   =   GPIO_Pin_13|GPIO_Pin_12|GPIO_Pin_11;	//选择要控制的GPIOC引脚
		GPIO_InitStructure.GPIO_Speed =   GPIO_Speed_50MHz;		//设置引脚速率为50MHz
		GPIO_InitStructure.GPIO_Mode  =   GPIO_Mode_Out_PP;		//设置引脚模式为通用推挽输出
		GPIO_Init(GPIOC, &GPIO_InitStructure); 				//调用库函数，初始化GPIOC
	
	
}
/**************************************************************************
	函数名          ：relay_on;
	功能            ：打开水泵
***************************************************************************/
void relay_on(void)                 
{
	GPIO_SetBits(GPIOC,GPIO_Pin_13);
}
/**************************************************************************
	函数名          ：relay_off;
	功能            ：水泵
**************************************************************************/
void relay_off(void)
{
	GPIO_ResetBits(GPIOC,GPIO_Pin_13);
}

/**************************************************************************
	函数名          ：relay_on1;
	功能            ：打开风扇
***************************************************************************/
void relay_on1(void)                 
{
	GPIO_SetBits(GPIOC,GPIO_Pin_12);
}
/**************************************************************************
	函数名          ：relay_off1;
	功能            ：关闭风扇
***************************************************************************/
void relay_off1(void)
{
	GPIO_ResetBits(GPIOC,GPIO_Pin_12);
}
/**************************************************************************
	函数名          ：relay_on2;
	功能            ：打开灯
***************************************************************************/
void relay_on2(void)                 
{
	GPIO_SetBits(GPIOC,GPIO_Pin_11);
}
/**************************************************************************
	函数名          ：relay_off2;
	功能            ：关闭灯
***************************************************************************/
void relay_off2(void)
{
	GPIO_ResetBits(GPIOC,GPIO_Pin_11);
}
